tap "buildpacks/tap"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sdkman/tap"
tap "spring-io/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# XML-based font configuration API for X Windows
brew "fontconfig"
# OpenType text shaping engine
brew "harfbuzz"
# Google's own build tool
brew "bazel"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Fast, Dynamic Programming Language
brew "julia"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Java-based project management
brew "maven"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# V programming language
brew "vlang"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Sdkman - The Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
brew "spring-io/tap/spring-boot"
# Chromium based browser
cask "arc"
# Text editor
cask "emacs"
# Developer targeted fonts with a high number of glyphs
cask "font-3270-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-agave-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-arimo-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-aurulent-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bigblue-terminal-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bitstream-vera-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-cousine-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-daddy-time-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-dejavu-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-go-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-gohufont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hasklug-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-heavy-data-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hurmit-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-im-writing-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lekton-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-liberation-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lilex-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monofur-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monoid-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-mononoki-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-mplus-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-open-dyslexic-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-overpass-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-profont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-proggy-clean-tt-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-shure-tech-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-space-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-terminess-ttf-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-tinos-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Neovim Client
cask "neovide"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Video game digital distribution service
cask "steam"
# Keyboard configurator
cask "via"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Rust-based terminal
cask "warp"
# Torrent streaming application
cask "webtorrent"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onelight"
vscode "alekangelov.alek-kai-theme"
vscode "AndenetAlexander.vim-cheatsheet"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "Codeium.codeium"
vscode "csstools.postcss"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "doggy8088.quicktype-refresh"
vscode "eamodio.gitlens"
vscode "ElAnandKumar.el-vsc-product-icon-theme"
vscode "EliverLara.sweet-vscode-icons"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "Gruntfuggly.todo-tree"
vscode "HarryHopkinson.vim-theme"
vscode "jdinhlife.gruvbox"
vscode "jsayol.firebase-explorer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "nrwl.angular-console"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "rubenverg.bootstrap-product-icons"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "scrimba.vsimba"
vscode "SolarLiner.linux-themes"
vscode "stevencl.addDocComments"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "Tobermory.es6-string-html"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vlanguage.vscode-vlang"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "whizkydee.material-palenight-theme"
vscode "zhuangtongfa.material-theme"
vscode "ZixuanChen.vitest-explorer"
